// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
//
// let num1 = +prompt('number one');
// let num2 = +prompt('number two');
//
// if (num1 > num2) {
//     console.log(`Максимальне число ${num1}`);
//     alert(`Максимальне число ${num1}`)
// } else if (num2 > num1) {
//     console.log(`Максимальне число ${num2}`);
//     alert(`Максимальне число ${num2}`)
// } else {
//     console.log(`Числа ${num1} та ${num2} рівні`);
//     alert(`Числа ${num1} та ${num2} рівні`)
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flat = parseInt(prompt('Number flat'));
//
// if (flat >= 1 && flat <= 20) {
//     console.log(`Ця квартира в першому підїзді`);
//     alert(`Ця квартира в першому підїзді`);
// } else if (flat >= 21 && flat <= 48) {
//     console.log(`Ця квартира в другому підїзді`);
//     alert(`Ця квартира в другому підїзді`);
// } else if (flat >= 49 && flat <= 90) {
//     console.log(`Ця квартира в третьому підїзді`);
//     alert(`Ця квартира в третьому підїзді`);
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// let number = +prompt('input number');
//
// if (number === 10) {
//     console.log('Вірно');
//     alert('Вірно')
// } else {
//     console.log('НЕВІРНО');
//     alert('НЕВІРНО')
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else


//
// let x = 5;
// let x = 'string';
//  let x = []
// let x = false;
//  let x = undefined;
//
// if (typeof x === 'number') {
//     document.write(`<h2>1, зміна число</h2>`);
//     alert(`1, зміна число`)
// } else if (typeof x === "string") {
//     document.write(`<h2>2, зміна cтрічка</h2>`);
//     alert('2, зміна cтрічка')
// } else if (typeof x === "object") {
//     document.write(`<h2>3, зміна обєкт</h2>`);
//     alert('3, зміна обєкт')
// } else if (typeof x === "boolean") {
//     document.write(`<h2>4, зміна буліан</h2>`);
//     alert('4, зміна буліан')
// } else {
//     document.write(`<h2>немає співпадінь</h2>`)
//     alert('немає співпадінь')
// }
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = +prompt('enter the temperature outside');
// if (temperature >= 10 && temperature <= 22) {
//     console.log(`сьогодні гарна погода + ${temperature}, йдено в Okten!`);
//     document.write(`<h2>сьогодні гарна погода + ${temperature}, йдено в Okten!</h2>`);
//     alert(`сьогодні гарна погода + ${temperature}, йдено в Okten!`);
// } else {
//     console.log('шкода, прийдеться вчитись ОНЛАЙН');
//     document.write(`<h3>шкода, прийдеться вчитись ОНЛАЙН</h3>`);
//     alert('шкода, прийдеться вчитись ОНЛАЙН');
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
//
// let loto = +prompt('loto number');
//
// switch (loto) {
//     case 1:
//         console.log(`Ваш номер ${loto}, ви виграли Авто`);
//         document.write(`<h2>Ваш номер ${loto}, ви виграли Авто!</h2>`);
//         alert(`Ваш номер ${loto}, ви виграли Авто`);
//         break;
//     case 2:
//         console.log(`Ваш номер ${loto}, ви виграли Мото`);
//         document.write(`<h2>Ваш номер ${loto}, ви виграли Мото!</h2>`);
//         alert(`Ваш номер ${loto}, ви виграли Мото`);
//         break;
//     case 3 :
//         console.log(`Ваш номер ${loto}, ви виграли Телефон`);
//         document.write(`<h2>Ваш номер ${loto}, ви виграли Телефон!</h2>`);
//         alert(`Ваш номер ${loto}, ви виграли Телефон`);
//         break;
//     case 4:
//         console.log(`Ваш номер ${loto}, ви виграли Курс в Okten`);
//         document.write(`<h2>Ваш номер ${loto}, ви виграли Курс в Okten!</h2>`);
//         alert(`Ваш номер ${loto}, ви виграли Курс в Okten`);
//         break;
//     case 5:
//         console.log(`Ваш номер ${loto}, ви виграли Ноутбук`);
//         document.write(`<h2>Ваш номер ${loto}, ви виграли Ноутбук!</h2>`);
//         alert(`Ваш номер ${loto}, ви виграли Курс в Ноутбук`);
//         break;
//     default :
//         console.log('Шкода, ви нічого не виграли');
//         document.write(`<h2>Шкода, ви нічого не виграли</h2>`);
//         alert('Шкода, ви нічого не виграли');
// }

